src/cf/Catalogs/вогНастройкиБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогНастройкиБизнесПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиенты</Name>
					<Comment>По клиентам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияДанныхКлиенты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогВариантыЗаполненияДанныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>По номенклатуре</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коллекции</Name>
					<Comment>По коллекциям</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияДанныхНоменклатураКоллекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогВариантыЗаполненияДанныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоРасчетаПроцентаВыполненияЗадач</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повестка</Name>
					<Comment>По повестке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыеТочки</Name>
					<Comment>По клиентам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияДанныхТорговыеТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогВариантыЗаполненияДанныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНаКаждыйПредмет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Категории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступнаДляСобственника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/вогНастройкиБизнесПроцессов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыНастройки(ПараметрНастройкиСсылка) Экспорт

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Клиенты");
	СтруктураРеквизитов.Вставить("Номенклатура");
	СтруктураРеквизитов.Вставить("Коллекции");
	СтруктураРеквизитов.Вставить("Повестка");
	//>>Бей(27.05.2019 15:30:57):#176
	СтруктураРеквизитов.Вставить("ТорговыеТочки");
	СтруктураРеквизитов.Вставить("ВариантЗаполненияДанныхТорговыеТочки");
	//<<Бей(27.05.2019 15:31:01):#176	
	СтруктураРеквизитов.Вставить("ВариантЗаполненияДанныхНоменклатураКоллекции");
	СтруктураРеквизитов.Вставить("ВариантЗаполненияДанныхКлиенты");
	СтруктураРеквизитов.Вставить("ПравилоРасчетаПроцентаВыполненияЗадач");
	СтруктураРеквизитов.Вставить("ЗаполнятьНаселенныйПункт"); //VOG Ульянов И.В. 03.02.2020 CRM-264
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрНастройкиСсылка, СтруктураРеквизитов);
	Если Не ЗначениеЗаполнено(ПараметрНастройкиСсылка) Тогда
		Реквизиты.Вставить("Клиенты", Ложь);
		Реквизиты.Вставить("Номенклатура", Ложь);
		Реквизиты.Вставить("Коллекции", Ложь);
		Реквизиты.Вставить("Повестка", Ложь);
		//>>Бей(27.05.2019 15:31:36):#176
		Реквизиты.Вставить("ТорговыеТочки", Ложь);
		//<<Бей(27.05.2019 15:31:39):#176
		Реквизиты.Вставить("ЗаполнятьНаселенныйПункт", Ложь); //VOG Ульянов И.В. 03.02.2020 CRM-264
	
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции // ПараметрыНастройки()

#КонецОбласти

#КонецЕсли
